:PROPERTIES:
:ID:       e446ba35-7e99-4b81-b6e3-8e1f6be335d3
:END:
#+property: header-args: coq :session :results output
#+title: Coq Tactics Cheat Sheet
#+options: toc:3
#+setupfile: "~/Documents/org/resources/SetupFiles/cheatsheet.org"
#+LATEX_HEADER: \usepackage{ebproof, makecell}
#+LATEX_CLASS_OPTIONS: [a4paper,landscape,columns=2]
#+date: 2025-04-26
#+filetags: :cheat_sheet:coq:

** Basic Usage and Examples
You can unpack multiple levels at once using nested
intro patterns: if the goal is =P /\ exists x : option A, Q1 \/ Q2) ->(...)= then =intros [H [[x|] [G|G]]]=
splits the conjunction, unpacks the existential, case analyzes the =x : option A=, and case analyzes
the disjunction (creating 4 subgoals). The =intros= tactic can also be chained to introduce multiple
hypotheses: =intros x y.=\(\equiv\)  =intros x. intros y=

|-----------------------------+---------------------------------------------------------|
| *Data Pattern*              | *Description*                                           |
|-----------------------------+---------------------------------------------------------|
| \( \exists x,\ P \)         | =[x H]=                                                 |
| \( P \land Q \)             | =[H1 H2]=                                               |
| \( P \lor Q \)              | =[H1= \(\mid\) =H2]=                                    |
| \( \text{False} \)          | =[]=                                                    |
| \( A \ast B \)              | =[x y]=                                                 |
| \( A + B \)                 | =[x= \(\mid\) =y]=                                      |
| \( \text{option}\ A \)      | =[x= \(\mid\) =]=                                       |
| \( \text{bool} \)           | =[= \(\mid\) =]=                                        |
| \( \text{nat} \)            | =[= \(\mid\) =n]=                                       |
| \( \text{list}\ A \)        | =[x xs= \(\mid\) =]=                                    |
| \( \text{Inductive type} \) | =[a b= \(\mid\) =c d e= \(\mid\) =f]=                   |
| \( \text{Inductive type} \) | =[]= (unpack with names chosen by Coq)                  |
| \( x = y \)       | =->= (substitute the equality \(x\mapsto y\))           |
| \( x = y \)        | =<-= (substitute the equality \(y\mapsto x\) )          |
| \( \text{Any} \)            | =?= (introduce variable/hypothesis with name chosen by Coq) |
|-----------------------------+---------------------------------------------------------|
#+begin_src coq :session :results output
Goal forall A B C:Prop, A \/ B /\ C -> (A -> C) -> C.
intros A B C [HA|[_ HC]] HAC.
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall A B C : Prop, A \/ B /\ C -> (A -> C) -> C

2 goals

  A, B, C : Prop
  HA : A
  HAC : A -> C
  ============================
  C

goal 2 is:
 C
#+end_example

** =intros=: Introduces hypotheses, variables, or decomposes implications/universal quantifiers.
The =intros= tactic finds assumptions built into your goal (usually in the form of a =forall= quantifier) and moves them to the goal’s context (or hypothesis space). This is similar to the first step of many informal, paper proofs, when the prover states “let there be some number \(n \dots\)."
More specifically, =intros= /specializes/ a goal by looking for type inhabitation and proposition assumptions and moving them into the assumption space. For example, if you write
#+begin_src coq
forall (n : nat), n + 0 = n
#+end_src
the =forall= is acting as an assumption that there is a value of type =nat= that we can call =n=. Calling =intros= here will provide you an assumption =n= that there is a value of type =nat=.

 If used without arguments, the names of the assumptions are chosen by default to be the variables. then the hypotheses \(H, H_0, H_1\) etc. It is good practice to name these yourself.

\[\boxed{\begin{prooftree}
\infer1{\sf \forall x\,y, P \to Q \to R}
\end{prooftree}
\quad \rightsquigarrow \quad
\begin{prooftree}
\hypo{\sf x : X }
\infer [rule style=no rule]  1{\sf y : Y}
\infer [rule style=no rule]  1{\sf H1 : P}
\infer [rule style=no rule]  1{\sf H2 : Q}
\infer1{\sf R}
\end{prooftree} } \]


Some examples. Pay attention to the state before and after:

#+begin_src coq :session :results output
Theorem plus_0_n: forall(n:nat),
    0 + n = n.
Proof.
  intros n.
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall n : nat, 0 + n = n

1 goal

  n : nat
  ============================
  0 + n = n
#+end_example

#+begin_src coq :session :results output
Theorem plus_id_exercise : forall n m o : nat,
  n = m -> m = o -> n + m = m + o.
Proof. intros n m o H H'. Show Proof.
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall n m o : nat, n = m -> m = o -> n + m = m + o

1 goal

  n, m, o : nat
  H : n = m
  H' : m = o
  ============================
  n + m = m + o

(fun (n m o : nat) (H : n = m) (H' : m = o) => ?Goal)
#+end_example
The variant  =introv= allows to automatically introduce the variables of a theorem and explicitly name the hypotheses involved.
** =apply=: Uses implications to transform goals and hypotheses.
If we have a hypothesis that says that \(H: X \implies Y,\) to prove \(Y\) all we really have to do is prove \(X.\) The tactic =apply= tries to match the current goal against the conclusion of the type of term. We can apply that hypothesis to a goal of \(y\) to transform it into \(x.\)
It can be thought of as applying the function \(H:X\to Y\) by Curry-Howard.

#+begin_latex
\begin{equation*}
\boxed{\begin{prooftree}
\hypo{\sf H: X\to Y}
\infer1{\sf Y}
\end{prooftree}
\quad \rightsquigarrow \quad
\begin{prooftree}
\hypo{\sf H:X\to Y}
\infer1{\sf X}
\end{prooftree}
}
\end{equation*}
#+end_latex
When using =apply H= with a lemma =H : P1 -> P2 -> (...) -> Q=, Coq will create subgoals for each assumption =P1, P2=, etc. If the lemma has no assumptions, then =apply H= finishes the goal. When using apply H with a quantified lemma =H : forall x, (...)=, Coq will try to automatically find the
right =x= for you. The apply tactic will fail if Coq cannot determine =x=. For example, you can then explicitly
choose the instantiation =4= for =x= using =apply (H 4)=.
#+begin_src coq :session :results output
Lemma modus_ponens:
  forall x y : Prop, (x -> y) -> x -> y.
Proof.
  intros.
  apply H.
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall x y : Prop, (x -> y) -> x -> y

1 goal

  x, y : Prop
  H : x -> y
  H0 : x
  ============================
  y

1 goal

  x, y : Prop
  H : x -> y
  H0 : x
  ============================
  x
#+end_example
** =exact=: Solves a goal by supplying the exact proof term.
Suppose your current goal is to prove some proposition =P=. If you already have a term =t= in scope (e.g., from hypotheses or definitions) such that =t : P=, then =exact t.= tells Coq: "Here is the proof you're asking for."  Coq checks whether =t= indeed has the required type (i.e., it matches the goal exactly). If it does, the goal is discharged.
#+begin_src coq :session :results output
Goal forall A B : Prop, A -> (A -> B) -> B.
Proof.
  intros A B HA HAB.
  exact (HAB HA). (* Applying a function of type A -> B to a term of type A *)
Qed.
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall A B : Prop, A -> (A -> B) -> B

1 goal

  A, B : Prop
  HA : A
  HAB : A -> B
  ============================
  B

No more goals.
#+end_example

*** Examples
:PROPERTIES:
:UNNUMBERED: t
:END:
#+begin_src coq :session :results output
Theorem law_of_contradiction : forall (P Q : Prop),
  P /\ ~P -> Q.
Proof.
  intros P Q P_and_not_P.
  destruct P_and_not_P as [P_holds not_P].
  contradiction.
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall P Q : Prop, P /\ ~ P -> Q

1 goal

  P, Q : Prop
  P_and_not_P : P /\ ~ P
  ============================
  Q

1 goal

  P, Q : Prop
  P_holds : P
  not_P : ~ P
  ============================
  Q

No more goals.
#+end_example

** =clear=: Removes hypotheses
The tactic =clear H= removes the named hypothesis from the current proof context. Fails if you try to remove a hypothesis that other hypotheses or the goal depend upon (unless you use =clear dependent=).
#+begin_src coq :session :results output
Lemma many_hypotheses :
  forall A B C : Prop, A -> B -> C -> A /\ C.
Proof.
  intros A B C HA HB HC.
  clear HB.          (* B wasn’t needed for this goal *)
  split; [ exact HA | exact HC ].
Qed.
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall A B C : Prop, A -> B -> C -> A /\ C

1 goal

  A, B, C : Prop
  HA : A
  HB : B
  HC : C
  ============================
  A /\ C

1 goal

  A, B, C : Prop
  HA : A
  HC : C
  ============================
  A /\ C

No more goals.
#+end_example

** =rename=: Renames hypotheses and variables
The tactic =rename= changes the name of an introduced variable or assumption.
#+begin_src coq :session :results output
Goal forall n:nat, n=n. intros. rename n into x.
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall n : nat, n = n

1 goal

  n : nat
  ============================
  n = n

1 goal

  x : nat
  ============================
  x = x
#+end_example
** =remember=:  Names an expression to avoid losing it across =destruct= or =induction=.
The =remember= tactic in Coq abstracts a complex term by replacing all its occurrences with a fresh variable and simultaneously introducing an equality hypothesis relating that variable to the original term. Given a term =t= of type =T=, remember =t= simply introduces a new variable =x= of type =T=, an hypothesis stating the equality =x = t= and replaces the instances of the term =t= by the variable =x=. The usual variants work:
#+begin_src coq :session :results output
Goal forall x y: nat, x+y=y -> y=0.
intros x y H.  remember (x + y) as sum eqn: Hsum.
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall x y : nat, x + y = y -> y = 0

1 goal

  x, y : nat
  H : x + y = y
  ============================
  y = 0

1 goal

  x, y, sum : nat
  Hsum : sum = x + y
  H : sum = y
  ============================
  y = 0
#+end_example
This is mainly useful because, for technical reasons, when you perform induction over an hypothesis of an inductive type, it first generalizes all of its arguments. If your hypothesis is too weak, you may find yourself without enough information to complete the proof, and this . (see the IndProp chapter in [cite:@Pierce:SF1] for more)
** =generalize=: Adds universal quantification to the goal.
 The tactic applies to any goal. It generalizes the conclusion w.r.t. one subterm of it. If the goal is =G= and =t= is a subterm of type =T= in the goal, then =generalize t= replaces the goal by =forall (x:T), G'= where =G'= is obtained from =G= by replacing all occurrences of =t= by =x=. The name of the variable is chosen accordingly to =T=. For example:
 #+begin_src coq :session :results output
Lemma positivity:
  forall (x y : nat), 0 <= x + y + y.
Proof.
  intros. generalize (x + y + y).
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall x y : nat, 0 <= x + y + y

1 goal

  x, y : nat
  ============================
  0 <= x + y + y

1 goal

  x, y : nat
  ============================
  forall n : nat, 0 <= n
#+end_example
#+begin_latex
\begin{equation*}
\boxed{\begin{prooftree}
\infer1{\sf P}
\end{prooftree}
\quad \rightsquigarrow \quad
\begin{prooftree}
\infer1{\sf \forall x. P'}
\infer [rule style=no rule]  1{\sf \text{(where } P' \text{ is }P\text{ with all occurences of the term replaced by  }x.)}
\end{prooftree}
}
\end{equation*}
#+end_latex
Note that unlike =revert=, =generalize= works on arbitrary terms, even those not named by identifiers, allowing you to abstract complex subexpressions directly.

The =generalize dependent= variant goes further by also moving any hypotheses that depend on the given term back into the goal, ensuring that dependencies are correctly captured when reordering or reusing variables.
*** Examples
:PROPERTIES:
:UNNUMBERED: t
:END:
   #+begin_src coq :session :results output
Goal (forall n m : nat, n + m = m + n) -> True.
Proof.
  intros H.
  (* Before: H : forall n m : nat, n + m = m + n *)
  specialize (H 1 2).
  (* After:  H : 1 + 2 = 2 + 1 *)
  exact I.
Qed.
   #+end_src

   #+RESULTS:
   #+begin_example
   1 goal

     ============================
     (forall n m : nat, n + m = m + n) -> True

   1 goal

     H : forall n m : nat, n + m = m + n
     ============================
     True

   1 goal

     H : 1 + 2 = 2 + 1
     ============================
     True

   No more goals.
   #+end_example

- **Proof term:** \( (\lambda (H: P^x_e \Rightarrow \blacksquare) (H e) \)
** =cut=: Prove an intermediate hypothesis first, then show it implies the goal..
Sometimes to prove a goal you need an extra hypothesis. You can add the hypothesis using =cut=. This allows you to first prove your goal using the new hypothesis, and then prove that the new hypothesis is also true.  =cut P= transforms the current goal =P= into the two following subgoals: =Q -> P= and =Q=. The subgoal =Q -> P= comes first in the list of remaining subgoals to prove.
#+begin_latex
\begin{equation*}
\boxed{\begin{prooftree}
\infer1{\sf P}
\end{prooftree}
\quad \rightsquigarrow \quad
\begin{prooftree}
\infer1{\sf Q \to P}
\end{prooftree}
\qand
\begin{prooftree}
\infer1{\sf Q }
\end{prooftree}
}
\end{equation*}
#+end_latex


In this example we will prove that if =x = y= and =y = z= then =f x = f z=, for any function =f=. We first add the intermediate proposition that =x = z=. Then we have to prove that =x = z= implies =f x = f z=, and that =x= is actually equal to =z=.
#+begin_src coq :session :results output
Inductive bool: Set :=
  | true
  | false.

Lemma xyz:
  forall (f: bool->bool) x y z,
    x  = y -> y = z -> f x = f z.
Proof.
  intros.
  cut (x = z).
#+end_src

#+RESULTS:
#+begin_example
bool is defined
bool_rect is defined
bool_ind is defined
bool_rec is defined
bool_sind is defined

1 goal

  ============================
  forall (f : bool -> bool) (x y z : bool), x = y -> y = z -> f x = f z

1 goal

  f : bool -> bool
  x, y, z : bool
  H : x = y
  H0 : y = z
  ============================
  f x = f z

2 goals

  f : bool -> bool
  x, y, z : bool
  H : x = y
  H0 : y = z
  ============================
  x = z -> f x = f z

goal 2 is:
 x = z
#+end_example

*** Usage
:PROPERTIES:
:UNNUMBERED: t
:END:
- =rewrite H=: Rewrite =H : x = y= or =H : P <-> Q= (in the goal).
- =rewrite H in G=: Rewrite =H= (in hypothesis =G=).
- =rewrite H in *=: Rewrite =H= (everywhere).
- =rewrite <- H=: Rewrite =H : x = y= backwards.
- =rewrite H,G=: Rewrite using =H= and then =G=.
- =rewrite !H=: Repeatedly rewrite using =H=.
- =rewrite ?H=: Try rewriting using =H=.

Rewriting also works with quantified equalities. If you have =H : forall n m, n + m = m + n= then you can still do =rewrite H= and Coq will instantiate =n= and =m= based on what it finds in the goal. You can specify a particular instantiation =n = 3, m = 5= using =rewrite (H 3 5)=.
#+begin_src coq :session :results output
Axiom H : forall n m, n + m = m + n.
Theorem add_assoc : forall n m p : nat,
  n + (p + m) = (n + m) + p.
Proof. intros. rewrite (H p m).
#+end_src

#+RESULTS:
#+begin_example
H is declared

1 goal

  ============================
  forall n m p : nat, n + (p + m) = n + m + p

1 goal

  n, m, p : nat
  ============================
  n + (p + m) = n + m + p

1 goal

  n, m, p : nat
  ============================
  n + (m + p) = n + m + p
#+end_example

** =subst=: Substitutes away all assumptions of the form =x = e=.
The tactic =subst x= replaces =x= with an equivalent value defined by an equation involving =x= in the assumptions or a definition of =x=. After that the assumption is removed. When called without any arguments it substitutes everything it can.
Given a variable =x, subst x= will find an assumption =x = e= or =e = x= in the context, replace =x= with =e= throughout the context and current goal, and clear the assumption.

#+begin_latex
\begin{equation*}
\boxed{\begin{prooftree}
\hypo{\sf x := t}
\infer1{\sf p \,x}
\end{prooftree}
\quad \rightsquigarrow \quad
\begin{prooftree}
\infer1{\sf p\, t}
\end{prooftree}
}
\end{equation*}
#+end_latex
#+begin_src coq :session :results output
Inductive bool: Set :=
  | true
  | false.

Lemma equality_commutes:
  forall (a: bool) (b: bool), a = b -> b = a.
Proof.
  intros.
  subst a.
#+end_src

#+RESULTS:
#+begin_example
bool is defined
bool_rect is defined
bool_ind is defined
bool_rec is defined
bool_sind is defined

1 goal

  ============================
  forall a b : bool, a = b -> b = a

1 goal

  a, b : bool
  H : a = b
  ============================
  b = a

1 goal

  b : bool
  ============================
  b = b
#+end_example

*** Proof term
:PROPERTIES:
:UNNUMBERED: t
:END:
The goal =?Goal= gets replaced with =eq_sym ?Goal=
#+begin_src coq :session :results output
Theorem silly3 : forall (n m : nat),
  n = m ->
  m = n.
Proof.
  intros n m H. symmetry. Show Proof.
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall n m : nat, n = m -> m = n

1 goal

  n, m : nat
  H : n = m
  ============================
  m = n

1 goal

  n, m : nat
  H : n = m
  ============================
  n = m

(fun (n m : nat) (H : n = m) => eq_sym ?Goal)
#+end_example

** =f_equal=: Proves equality of structured terms (e.g., =f a = g b=).
For a goal with the form =f a1 ... an = g b1 ... bn=, creates subgoals =f = g= and =ai = bi= for the =n= arguments. Subgoals that can be proven by =reflexivity= or =congruence= are solved automatically.
#+begin_latex
\begin{equation*}
\boxed{\begin{prooftree}
\infer1{\sf f \,a1\cdots an = g\, b1\cdots bn}
\end{prooftree}
\quad \rightsquigarrow \quad
\begin{prooftree}
\infer1{\sf f=g}
\end{prooftree}
\,\,
\begin{prooftree}
\infer1{\sf a1=b1}
\end{prooftree}
\cdots
\begin{prooftree}
\infer1{\sf an=bn }
\end{prooftree}
}
\end{equation*}
#+end_latex
An example
#+begin_src coq :session :results output
Goal forall (n m : nat),  n = m -> S n = S m.
intros n m H. f_equal. assumption.
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall n m : nat, n = m -> S n = S m

1 goal

  n, m : nat
  H : n = m
  ============================
  S n = S m

1 goal

  n, m : nat
  H : n = m
  ============================
  n = m

No more goals.
#+end_example
Functions are functional, thus if we want to show =f x = f y= it’s always
sufficient to show =x = y=. This is also true for constructors by injectivity.

#+begin_src coq :session :results output
Require Import List.

Goal forall (a a' : nat) s, a :: s = a' :: s.
intros.
f_equal.
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall (a a' : nat) (s : list nat), a :: s = a' :: s

1 goal

  a, a' : nat
  s : list nat
  ============================
  a :: s = a' :: s

1 goal

  a, a' : nat
  s : list nat
  ============================
  a = a'
#+end_example

*Caveat:* Using =f_equal= on non-injective functions can produce absurd subgoals.
#+begin_src coq :session :results output
Require Import Arith.
Goal 1 mod 2 = 3 mod 4.
f_equal.
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  1 mod 2 = 3 mod 4

2 goals

  ============================
  1 = 3

goal 2 is:
 2 = 4
#+end_example

*** Examples
:PROPERTIES:
:UNNUMBERED: t
:END:
#+begin_src coq :session :results output
Goal forall n: nat, S n = 0 -> 2 + 2 = 5. intros. discriminate.
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall n : nat, S n = 0 -> 2 + 2 = 5

1 goal

  n : nat
  H : S n = 0
  ============================
  2 + 2 = 5

No more goals.
#+end_example
#+begin_src coq :session :results output
Require Import List.
Goal forall (X : Type) (x y z : X) (l j : list X),
    x :: y :: l = nil ->
    x = z.
intros X x y z l j H. discriminate H.
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall (X : Type) (x y z : X) (l : list X),
  list X -> x :: y :: l = nil -> x = z

1 goal

  X : Type
  x, y, z : X
  l, j : list X
  H : x :: y :: l = nil
  ============================
  x = z

No more goals.
#+end_example

** =injection=: Decompose =H : C x = C y= into =x = y=.
The injection tactic is based on the fact that constructors of inductive sets are injections i.e., that whenever two objects were built using the same introduction rule, then this rule should have been applied to the same element.

This tactic is applied to a term \(t\) of type  \(C\, x_1 \dots x_n = C\, y_1 \dots y_n ”,\) where \(C\) is some constructor of an inductive type. The tactic =injection= is applied as deep as
possible to derive the equality of all pairs of subterms of \(t_i\) and \(t'_i\) placed in
the same position. All these equalities are put as antecedents of the current
goal.
#+begin_latex
\begin{equation*}
\boxed{\begin{prooftree}
\hypo{\sf H: C \,x1 \, xn = C\, y1\, yn}
\infer1{\sf P}
\end{prooftree}
\quad \rightsquigarrow \quad
\begin{prooftree}

\infer1{\sf x1=y1\to xn=yn\to P}
\end{prooftree}
}
\end{equation*}
#+end_latex
Given =H : C x1 x2 ... = C y1 y2 ..=, the tactic  =injection H as H1 H2 ...= generates one new hypothesis per constructor argument, e.g., =H1 : x1=y1, H2 : x2=y2 ...=. The hypothesis itself is removed from context: sometimes we write =injection H as H= if there is only one argument, and we want to peel off the constructor on the hypothesis.

#+begin_src coq :session :results output
Theorem S_injective' : forall(n m : nat),
  S n = S m ->
  n = m.
Proof.
  intros n m H.
  injection H as H. apply H.
Qed.
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall n m : nat, S n = S m -> n = m

1 goal

  n, m : nat
  H : S n = S m
  ============================
  n = m

1 goal

  n, m : nat
  H : n = m
  ============================
  n = m

No more goals.
#+end_example
#+begin_remark
Please make sure the tactic is running on a constructor!!!!
#+end_remark

** =replace=:  Replaces a term with a equivalent term and generates a subgoal to prove that the equality holds.
The tactic =replace A with B= replaces all occurrences of =A= with
=B= in the goal. A new subgoal of the form =A = B= is generated and solved if
it occurs in the assumptions.
#+begin_src coq :session :results output
Theorem one_x_one : forall (x : nat),
  1 + x + 1 = 2 + x.
Proof.
  intro; simpl.
  replace (x + 1) with (S x).
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall x : nat, 1 + x + 1 = 2 + x

1 goal

  x : nat
  ============================
  S (x + 1) = S (S x)

2 goals

  x : nat
  ============================
  S (S x) = S (S x)

goal 2 is:
 S x = x + 1
#+end_example

#+begin_latex
\begin{equation*}
\boxed{\begin{prooftree}
\infer1{\sf P}
\end{prooftree}
\quad \rightsquigarrow \quad
\begin{prooftree}
\infer1{\sf P[A\leftarrow B]}
\infer [rule style=no rule]  1{\sf \text{(where } A \text{ is replaced with }B\text{ in  }P)}
\end{prooftree}
\qand
\begin{prooftree}
\infer1{\sf A = B }
\end{prooftree}
}
\end{equation*}
#+end_latex

Common variants: in, by

*** Generating equations (=eqn:E=)
:PROPERTIES:
:UNNUMBERED: t
:END:
Sometimes you need to keep track of which case you’re in by recalling the original identifier. The =eqn:= annotation generates a new hypothesis in each new subgoal that is an equality between the term being case-analyzed and the associated constructor.
#+begin_src coq :session :results output
Theorem idempotence:  forall (f:bool -> bool) (b:bool), f (f (f b)) = f b.
Proof.
  intros f b. destruct (f true) eqn:Hft;
    destruct (f false) eqn:Hff;
    destruct b; congruence. (* also do 2 (try rewrite Hft; try rewrite Hff); auto. *)
Qed.
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall (f : bool -> bool) (b : bool), f (f (f b)) = f b

1 goal

  f : bool -> bool
  b : bool
  ============================
  f (f (f b)) = f b

No more goals.
#+end_example

*** Examples
:PROPERTIES:
:UNNUMBERED: t
:END:
#+begin_src coq :session :results output
Goal forall n, n + 0 = n.
Proof.
  intros n.
  induction n as [      (* base: n = 0, no IH *)
  | n' IHn' ].          (* inductive: n = S n', with IHn': n' + 0 = n' *)
  - simpl. reflexivity.
  - simpl. rewrite IHn'. reflexivity.
Qed.
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall n : nat, n + 0 = n

1 goal

  n : nat
  ============================
  n + 0 = n

2 goals

  ============================
  0 + 0 = 0

goal 2 is:
 S n' + 0 = S n'

1 goal

  ============================
  0 + 0 = 0

1 goal

  ============================
  0 = 0

This subproof is complete, but there are some unfocused goals.
Focus next goal with bullet -.

1 goal

goal 1 is:
 S n' + 0 = S n'

1 goal

  n' : nat
  IHn' : n' + 0 = n'
  ============================
  S n' + 0 = S n'

1 goal

  n' : nat
  IHn' : n' + 0 = n'
  ============================
  S (n' + 0) = S n'

1 goal

  n' : nat
  IHn' : n' + 0 = n'
  ============================
  S n' = S n'

No more goals.
#+end_example
- *Base case:* =n = 0=. No =IH= since 0 has no recursive arguments.
- *Inductive case:* =n = S n'=. We get =IHn' : n' + 0 = n'=.

You can also give explicit names to the generated equations like in =destruct=:
#+begin_src coq
induction n as [| n' IHn'] eqn:En.
#+end_src
=eqn:En= adds =En : n = 0= in the first branch and =En : n = S n'= in the second.

** =inversion=: Deduces equalities that must be true given an equality between two constructors.
Sometimes you have a hypothesis that can't be true unless other things are also true. We can use inversion to discover other necessary conditions for a hypothesis to be true.
The inversion tactic is used like this. Suppose =H= is a hypothesis of the form
     =C a1 a2 ... an = D b1 b2 ... bm=
for some constructors c and d and arguments =a1 ... an and b1 ... bm=. Then =inversion H= instructs Coq to "invert" this equality to extract the information it contains about these terms:
- If =C= and =D= are the same constructor, then we know, by the injectivity of this constructor, that =a1 = b1, a2 = b2=, etc.; =inversion H= adds these facts to the context, and tries to use them to rewrite the goal.
- If =C= and =D= are different constructors, then the hypothesis =H= is contradictory. In this case, =inversion H= marks the current goal as completed and pops it off the goal stack.
#+begin_src coq :session :results output
Inductive ev : nat -> Prop :=
  | ev_O : ev 0
  | ev_SS : forall n, ev n -> ev (S (S n)).

Theorem evSS_ev' : forall n, ev (S (S n)) -> ev n.
Proof.
  intros n E. inversion E as [| n' E' Hnn'].
  (* now in the ev_SS case: n = S (S n') and Hnn': n = n' *)
  apply E'.
Qed.
#+end_src

#+RESULTS:
#+begin_example
ev is defined
ev_ind is defined
ev_sind is defined

1 goal

  ============================
  forall n : nat, ev (S (S n)) -> ev n

1 goal

  n : nat
  E : ev (S (S n))
  ============================
  ev n

1 goal

  n : nat
  E : ev (S (S n))
  n' : nat
  E' : ev n
  Hnn' : n' = n
  ============================
  ev n

No more goals.
#+end_example
It is often useful to define the tactic =Ltac inv H :=inversion_clear H; subst=. and use this
instead of =inversion=
** =constructor=: Applies a constructor of an inductive type (e.g., prove =A \/ B= via left).
This tactic applies to a goal such that the head of its conclusion is an inductive constant (say =T=).  Let =Ci= be the \(i^{th}\) constructor of =T=, then =constructor i= is equivalent to =intros; apply Ci=. If no number is specified the constructors in the premises are tried in order and the first one whose result type matches the goal is selected and unfolded. The advantage over a simple =apply= is isn't necessary to explicitly name the constructor.
#+begin_src coq :session :results output
Inductive even : nat -> Prop:=
 | even_O: even O
 | even_S: forall n, even n -> even (S(S n)).

Lemma four_is_even:
  even (S (S (S (S O)))).
Proof.
  constructor.  (* picks even_S: generates subgoal even 2 *)
  constructor.  (* picks even_S again: generates subgoal even 0 *)
  constructor.  (* picks even_0: no subgoals left *)
Qed.
#+end_src

#+RESULTS:
#+begin_example
even is defined
even_ind is defined
even_sind is defined

1 goal

  ============================
  even 4

1 goal

  ============================
  even 2

1 goal

  ============================
  even 0

No more goals.
#+end_example

#+begin_latex
\begin{equation*}
\boxed{\begin{prooftree}
\hypo{\sf T\text{ has some constructor }} 
\infer [rule style=no rule]  1{\sf C_i:\forall x_{i}\,A_1\to A_2\cdots\to A_k\to T\, x_1\cdots x_n}
\infer1{\sf T\,u_1 u_2\cdots u_n}
\end{prooftree}
\quad \rightsquigarrow \quad
\begin{prooftree}
\infer1{\sf A_1\to A_2\cdots\to A_k }
\end{prooftree}
}
\end{equation*}
#+end_latex

 The tactics =split, exists, left= and =right= are all versions of this. When your goal is to show that you can build up a term that has some type and you have a constructor to do just that, use =constructor=! 
** =left= / =right=: Replaces a goal consisting of a disjunction =P \/ Q= with just =P= or =Q=.
 Apply if =I= has two constructors, for instance in the case of disjunction =P \/ Q=. Then, they are respectively equivalent to =constructor 1= and =constructor 2=.
#+begin_src coq :session :results output
Goal forall (P Q : Prop), P -> P \/ Q.
intros P Q HP. left. Show Proof.
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall P Q : Prop, P -> P \/ Q

1 goal

  P, Q : Prop
  HP : P
  ============================
  P \/ Q

1 goal

  P, Q : Prop
  HP : P
  ============================
  P

(fun (P Q : Prop) (HP : P) => or_introl ?Goal)
#+end_example

** =exists=: Puts in a witness into a proof with an existential quantifier.
 Applies if =I= has only one constructor, for instance in the case of existential quantification \(\exists x\mid P(x).\) Then, =exists t= is equivalent to =intros; constructor 1 with t=.
 #+begin_latex
\begin{equation*}
\boxed{\begin{prooftree}
\infer1{\sf \exists x. p x}
\end{prooftree}
\quad \rightsquigarrow \quad
\begin{prooftree}
\infer1{\sf p\,a}
\end{prooftree}
}
\end{equation*}
#+end_latex
The =eexists= variant will instantiate an existential quantifier with an e-var =?x=. For example, if your goal is =exists n, P n= and you have =H : P 3=,
then you can type =eexists; apply H=. This automatically determines that n should be 3.
#+begin_src coq :session :results output
Goal forall x:nat, exists y:nat, x*x=y.
#+end_src

#+RESULTS:
: 1 goal
:
:   ============================
:   forall x : nat, exists y : nat, x * x = y



*** Usage
:PROPERTIES:
:UNNUMBERED: t
:END:
- =simpl=:  rewrite with computation rules in  the goal.
- =simpl in H=: rewrite with computation rules in  the hypothesis \(H.\)
- =simpl in *=: rewrite with computation rules in all hypotheses and the goal. Nice to try when you don't know what to do.
#+begin_src coq :session :results output
Theorem plus_1_l_1__1olll: forall(n:nat),
    1 + n = S n.
Proof.
  intros n. simpl.
#+end_src

#+RESULTS:
#+begin_example
1 goal

  ============================
  forall n : nat, 1 + n = S n

1 goal

  n : nat
  ============================
  1 + n = S n

1 goal

  n : nat
  ============================
  S n = S n
#+end_example

** =auto= / =eauto=: Solve goals using a hint database (lemmas/constructors).
The =auto= tactic performs a bounded backward search using only the primitive tactics =reflexivity, assumption=, and =apply=, trying hints (lemmas or tactics) whose conclusion matches the goal head. The depth of proof search is limited to 5 by default, writing =auto n= uses =n= instead of =5=.

The =eauto= tactic extends auto by also using the =eapply= primitive, which allows it to defer instantiation of existential variables, thereby solving goals involving existential quantifiers more flexibly.
#+begin_src coq :session :results output 
Lemma exists_example : forall (P Q : nat -> Prop) x,
    P x -> (exists y, Q y) -> P x.
Proof. eauto. Qed.
#+end_src

#+RESULTS:
: 1 goal
:
:   ============================
:   forall (P Q : nat -> Prop) (x : nat), P x -> (exists y : nat, Q y) -> P x
:
: No more goals.

** =repeat=: Applies the given tactic repeatedly until it fails.

    Here is an example proving that =10= is in a long list using =repeat=.
#+begin_src coq :session :results output
From Coq Require Import Lists.List. Import ListNotations.
Theorem In10 : In 10 [1;2;3;4;5;6;7;8;9;10].
Proof.
  repeat (try (left; reflexivity); right).
Qed.
#+end_src

#+RESULTS:
: 1 goal
:
:   ============================
:   In 10 [1; 2; 3; 4; 5; 6; 7; 8; 9; 10]
:
: No more goals.
*Warning:* The tactic =repeat T= does not have any upper bound on the
    number of times it applies =T=.  If =T= _always_ succeeds (and makes progress), then =repeat T= will loop forever.
